In [1]:
import os, sys
import mysql.connector as connector
import subprocess
import logging
import getpass
sys.path.append("..")
from display.display_query import execute_display_query_results, select_all_query

## Create logger

In [2]:
logger = logging.getLogger("[SET Operators MySQL]")
if os.path.exists("../log/sets.log"):
  os.remove("../log/sets.log")
logging.basicConfig(filename='../log/sets.log', encoding='utf-8', level=logging.DEBUG, format='%(asctime)s ==> %(message)s', datefmt='%m/%d/%Y %I:%M:%S')

## Create Connection

In [3]:
logger.info("Creating a connection between MySQL and Python")
dbconfig={"user":"root", "password":os.environ["MYSQL_ROOT_PASSWORD"], "port":33061, "host":"localhost", "database": "db_advanced_sql_baraa"}
connection=connector.connect(**dbconfig)
print("Connection established between MySQL and Python")
logger.info("Connection established between MySQL and Python")

Connection established between MySQL and Python

## Create Cursor Object

In [4]:
print("Creating cursor object from connection")
logger.info("Creating first cursor object from connection")
cursor = connection.cursor()
print("Cursor object created to communicate with MySQL")
logger.info("Cursor object created to communicate with MySQL")

Creating cursor object from connection
Cursor object created to communicate with MySQL

# Set  Operators
Set Opetations in SQL combine the results of multiple queries into a single result set
<div style="text-align:center">
<img src="./joins_sets.png" alt="drawing" width="1000"/>
</div>

<div style="text-align:center">
<img src="./set_operators.png" alt="operators" width="1000"/>
</div>

## Rule One
- SET Operator can be used almost in all clauses WHERE | JOIN | GROUP BY | HAVING
- ORDER BY is allowed only once at the end of the query
<div style="text-align:center">
<img src="./rule_one.png" alt="rule_one" width="1000"/>
</div>

## Rule Two
- The number of columns in each query must be the same

## Rule Three 
- Data types of columns in each query must be compatible

## Rule Four 
- The order of the columns in each query must be the same

## Rule Five 
- The column names in the result set are determined by the column names specified in the first query

## Rule Six 
- Even if all rules are met and SQL shows no errors, the result may be incorrect. Incorrect column selection leads to inaccurate results.

In [5]:
print("\ntbl_orders")
execute_display_query_results(select_all_query("tbl_orders"), cursor)
print("\ntbl_products")
execute_display_query_results(select_all_query("tbl_products"), cursor)
print("\ntbl_customers")
execute_display_query_results(select_all_query("tbl_customers"), cursor)
print("\ntbl_employees")
execute_display_query_results(select_all_query("tbl_employees"), cursor)

tbl_orders
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |    8157 W. Book    | 8157 W. Book  |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane  |               |    2     |  60   | 2025-01-20 05:50:33 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  |  136 Balboa Court  |               |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |   2947 Vine Lane   | 4311 Clay Rd  |    3     |  90   | 2025-02-18 10:45:22 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
10 rows returned in time: (0.03 sec)

tbl_products
+-----------+---------+-------------+-------+
| ProductID | Product |  Category   | Price |
+-----------+---------+-------------+-------+
|    101    | Bottle  | Accessories |  10   |
|    102    |  Tire   | Accessories |  15   |
|    103    |  Socks  |  Clothing   |  20   |
|    104    |  Caps   |  Clothing   |  25   |
|    105    | Gloves  |  Clothing   |  30   |
+-----------+---------+-------------+-------+
5 rows returned in time: (0.003 sec)

tbl_customers
+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned in time: (0.003 sec)

tbl_employees
+------------+-----------+----------+------------+------------+--------+--------+-----------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID |
+------------+-----------+----------+------------+------------+--------+--------+-----------+
|     1      |   Frank   |   Lee    | Marketing  | 1988-12-05 |   M    | 55000  |   NULL    |
|     2      |   Kevin   |  Brown   | Marketing  | 1972-11-25 |   M    | 65000  |     1     |
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |
|     4      |  Michael  |   Ray    |   Sales    | 1977-02-10 |   M    | 90000  |     2     |
|     5      |   Carol   |  Baker   |   Sales    | 1982-02-11 |   F    | 55000  |     3     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+
5 rows returned in time: (0.002 sec)

In [6]:
select_query = """SELECT firstname, lastname FROM tbl_customers
UNION 
SELECT firstname, lastname FROM tbl_employees;
"""
execute_display_query_results(select_query, cursor)

+-----------+----------+
| firstname | lastname |
+-----------+----------+
|  Jossef   | Goldberg |
|   Kevin   |  Brown   |
|   Mary    |   NULL   |
|   Mark    | Schwarz  |
|   Anna    |  Adams   |
|   Frank   |   Lee    |
|  Michael  |   Ray    |
|   Carol   |  Baker   |
+-----------+----------+
8 rows returned in time: (0.01 sec)

In [7]:
show_query = """SHOW COLUMNS FROM tbl_customers;"""
execute_display_query_results(show_query, cursor)
print("\n")
show_query = """SHOW COLUMNS FROM tbl_employees;"""
execute_display_query_results(show_query, cursor)

+------------+-------------+------+-----+---------+-------+
|   Field    |    Type     | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
| CustomerID |     int     |  NO  | PRI |  NULL   |       |
| FirstName  | varchar(50) | YES  |     |  NULL   |       |
|  LastName  | varchar(50) | YES  |     |  NULL   |       |
|  Country   | varchar(50) | YES  |     |  NULL   |       |
|   Score    |     int     | YES  |     |  NULL   |       |
+------------+-------------+------+-----+---------+-------+
5 rows returned in time: (0.036 sec)


+------------+-------------+------+-----+---------+-------+
|   Field    |    Type     | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
| EmployeeID |     int     |  NO  | PRI |  NULL   |       |
| FirstName  | varchar(50) | YES  |     |  NULL   |       |
|  LastName  | varchar(50) | YES  |     |  NULL   |       |
| Department | varchar(50) | YES  |     |  NULL   |       |
| BirthDate  |    date     | YES  |     |  NULL   |       |
|   Gender   |   char(1)   | YES  |     |  NULL   |       |
|   Salary   |     int     | YES  |     |  NULL   |       |
| ManagerID  |     int     | YES  |     |  NULL   |       |
+------------+-------------+------+-----+---------+-------+
8 rows returned in time: (0.001 sec)

In [8]:
# Rule Five
select_query = """SELECT customerid as id, firstname, lastname FROM tbl_customers
UNION 
SELECT employeeid, firstname, lastname FROM tbl_employees;
"""
execute_display_query_results(select_query, cursor)

+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 1  |  Jossef   | Goldberg |
| 2  |   Kevin   |  Brown   |
| 3  |   Mary    |   NULL   |
| 4  |   Mark    | Schwarz  |
| 5  |   Anna    |  Adams   |
| 1  |   Frank   |   Lee    |
| 4  |  Michael  |   Ray    |
| 5  |   Carol   |  Baker   |
+----+-----------+----------+
8 rows returned in time: (0.001 sec)

In [9]:
# Combine the data from employees and customers into one table
select_query = """SELECT customerid as id, firstname, lastname FROM tbl_customers
UNION 
SELECT employeeid, firstname, lastname FROM tbl_employees;
"""
execute_display_query_results(select_query, cursor)

+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 1  |  Jossef   | Goldberg |
| 2  |   Kevin   |  Brown   |
| 3  |   Mary    |   NULL   |
| 4  |   Mark    | Schwarz  |
| 5  |   Anna    |  Adams   |
| 1  |   Frank   |   Lee    |
| 4  |  Michael  |   Ray    |
| 5  |   Carol   |  Baker   |
+----+-----------+----------+
8 rows returned in time: (0.001 sec)

# Union All: 
Returns all rows from both queries, including duplicates.  
It is generally faster than UNION

In [10]:
# Combine the data from employees and customers into one table including duplicates
select_query = """SELECT customerid as id, firstname, lastname FROM tbl_customers
UNION ALL
SELECT employeeid, firstname, lastname FROM tbl_employees;
"""
execute_display_query_results(select_query, cursor)

+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 1  |  Jossef   | Goldberg |
| 2  |   Kevin   |  Brown   |
| 3  |   Mary    |   NULL   |
| 4  |   Mark    | Schwarz  |
| 5  |   Anna    |  Adams   |
| 1  |   Frank   |   Lee    |
| 2  |   Kevin   |  Brown   |
| 3  |   Mary    |   NULL   |
| 4  |  Michael  |   Ray    |
| 5  |   Carol   |  Baker   |
+----+-----------+----------+
10 rows returned in time: (0.001 sec)

# Except 
- Returns all ***distinct*** rows from the ***first query*** that are not found in the ***second query***

In [11]:
# Combine the data from employees and customers into one table including duplicates
select_query = """SELECT customerid as id, firstname, lastname FROM tbl_customers
EXCEPT
SELECT employeeid, firstname, lastname FROM tbl_employees;
"""
execute_display_query_results(select_query, cursor)

print("\n")

select_query = """SELECT employeeid as id, firstname, lastname FROM tbl_employees
EXCEPT
SELECT customerid, firstname, lastname FROM tbl_customers;
"""
execute_display_query_results(select_query, cursor)

+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 1  |  Jossef   | Goldberg |
| 4  |   Mark    | Schwarz  |
| 5  |   Anna    |  Adams   |
+----+-----------+----------+
3 rows returned in time: (0.001 sec)


+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 1  |   Frank   |   Lee    |
| 4  |  Michael  |   Ray    |
| 5  |   Carol   |  Baker   |
+----+-----------+----------+
3 rows returned in time: (0.0 sec)

# Intersect
Returns only the rows that are common in both queries

In [12]:
# Combine the data from employees and customers into one table including duplicates
select_query = """SELECT customerid as id, firstname, lastname FROM tbl_customers
INTERSECT
SELECT employeeid, firstname, lastname FROM tbl_employees;
"""
execute_display_query_results(select_query, cursor)

print("\n")

select_query = """SELECT employeeid as id, firstname, lastname FROM tbl_employees
INTERSECT
SELECT customerid, firstname, lastname FROM tbl_customers;
"""
execute_display_query_results(select_query, cursor)

+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 2  |   Kevin   |  Brown   |
| 3  |   Mary    |   NULL   |
+----+-----------+----------+
2 rows returned in time: (0.001 sec)


+----+-----------+----------+
| id | firstname | lastname |
+----+-----------+----------+
| 2  |   Kevin   |  Brown   |
| 3  |   Mary    |   NULL   |
+----+-----------+----------+
2 rows returned in time: (0.0 sec)

In [13]:
# Combine similar results before doing analysis
select_query = """SELECT 'orders' as SourceTable, orderid, productid, customerid, orderdate, orderstatus, quantity, sales FROM tbl_orders
UNION
SELECT 'ordersarchive' as SourceTable, orderid, productid, customerid, orderdate, orderstatus,  quantity, sales FROM tbl_orders_archive;
"""
execute_display_query_results(select_query, cursor)

+---------------+---------+-----------+------------+------------+-------------+----------+-------+
|  SourceTable  | orderid | productid | customerid | orderdate  | orderstatus | quantity | sales |
+---------------+---------+-----------+------------+------------+-------------+----------+-------+
|    orders     |    1    |    101    |     2      | 2025-01-01 |  Delivered  |    1     |  10   |
|    orders     |    2    |    102    |     3      | 2025-01-05 |   Shipped   |    1     |  15   |
|    orders     |    3    |    101    |     1      | 2025-01-10 |  Delivered  |    2     |  20   |
|    orders     |    4    |    105    |     1      | 2025-01-20 |   Shipped   |    2     |  60   |
|    orders     |    5    |    104    |     2      | 2025-02-01 |  Delivered  |    1     |  25   |
|    orders     |    6    |    104    |     3      | 2025-02-05 |  Delivered  |    2     |  50   |
|    orders     |    7    |    102    |     1      | 2025-02-15 |  Delivered  |    2     |  30   |
|    orders     |    8    |    101    |     4      | 2025-02-18 |   Shipped   |    3     |  90   |
|    orders     |    9    |    101    |     2      | 2025-03-10 |   Shipped   |    2     |  20   |
|    orders     |   10    |    102    |     3      | 2025-03-15 |   Shipped   |    0     |  60   |
| ordersarchive |    1    |    101    |     2      | 2025-01-01 |  Delivered  |    1     |  10   |
| ordersarchive |    2    |    102    |     3      | 2025-01-05 |   Shipped   |    1     |  15   |
| ordersarchive |    3    |    101    |     1      | 2025-01-10 |  Delivered  |    2     |  20   |
| ordersarchive |    4    |    105    |     1      | 2025-01-20 |   Shipped   |    2     |  60   |
| ordersarchive |    4    |    104    |     2      | 2025-02-01 |  Delivered  |    1     |  25   |
| ordersarchive |    5    |    104    |     3      | 2025-02-05 |  Delivered  |    2     |  50   |
| ordersarchive |    6    |    102    |     1      | 2025-02-15 |  Delivered  |    2     |  30   |
| ordersarchive |    6    |    101    |     4      | 2025-02-18 |   Shipped   |    3     |  90   |
| ordersarchive |    6    |    101    |     2      | 2025-03-10 |   Shipped   |    2     |  20   |
| ordersarchive |    7    |    102    |     3      | 2025-03-15 |   Shipped   |    0     |  60   |
+---------------+---------+-----------+------------+------------+-------------+----------+-------+
20 rows returned in time: (0.002 sec)

In [14]:
select_query = """SELECT 'orders' as SourceTable, orderid, productid, customerid, orderdate, orderstatus, quantity, sales FROM tbl_orders
UNION
SELECT 'ordersarchive' as SourceTable, orderid, productid, customerid, orderdate, orderstatus,  quantity, sales FROM tbl_orders_archive
ORDER BY orderid;
"""
execute_display_query_results(select_query, cursor)

+---------------+---------+-----------+------------+------------+-------------+----------+-------+
|  SourceTable  | orderid | productid | customerid | orderdate  | orderstatus | quantity | sales |
+---------------+---------+-----------+------------+------------+-------------+----------+-------+
|    orders     |    1    |    101    |     2      | 2025-01-01 |  Delivered  |    1     |  10   |
| ordersarchive |    1    |    101    |     2      | 2025-01-01 |  Delivered  |    1     |  10   |
|    orders     |    2    |    102    |     3      | 2025-01-05 |   Shipped   |    1     |  15   |
| ordersarchive |    2    |    102    |     3      | 2025-01-05 |   Shipped   |    1     |  15   |
|    orders     |    3    |    101    |     1      | 2025-01-10 |  Delivered  |    2     |  20   |
| ordersarchive |    3    |    101    |     1      | 2025-01-10 |  Delivered  |    2     |  20   |
|    orders     |    4    |    105    |     1      | 2025-01-20 |   Shipped   |    2     |  60   |
| ordersarchive |    4    |    105    |     1      | 2025-01-20 |   Shipped   |    2     |  60   |
| ordersarchive |    4    |    104    |     2      | 2025-02-01 |  Delivered  |    1     |  25   |
|    orders     |    5    |    104    |     2      | 2025-02-01 |  Delivered  |    1     |  25   |
| ordersarchive |    5    |    104    |     3      | 2025-02-05 |  Delivered  |    2     |  50   |
|    orders     |    6    |    104    |     3      | 2025-02-05 |  Delivered  |    2     |  50   |
| ordersarchive |    6    |    102    |     1      | 2025-02-15 |  Delivered  |    2     |  30   |
| ordersarchive |    6    |    101    |     4      | 2025-02-18 |   Shipped   |    3     |  90   |
| ordersarchive |    6    |    101    |     2      | 2025-03-10 |   Shipped   |    2     |  20   |
|    orders     |    7    |    102    |     1      | 2025-02-15 |  Delivered  |    2     |  30   |
| ordersarchive |    7    |    102    |     3      | 2025-03-15 |   Shipped   |    0     |  60   |
|    orders     |    8    |    101    |     4      | 2025-02-18 |   Shipped   |    3     |  90   |
|    orders     |    9    |    101    |     2      | 2025-03-10 |   Shipped   |    2     |  20   |
|    orders     |   10    |    102    |     3      | 2025-03-15 |   Shipped   |    0     |  60   |
+---------------+---------+-----------+------------+------------+-------------+----------+-------+
20 rows returned in time: (0.004 sec)

# Case Statements
Evaluates a list of conditions and returns a value when the first condition is met
```sql
CASE 
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    .....
    ELSE resultn --optional
END
```
Main purpose is Data Transformation. Create New Columns based on Existing Columns.
- Categorizing Data
- Mapping Values: F - Female, Male -> Male

Rules: The data type of the results must be matching

## Task 1 
Generate a report showing the total sales for each category 
- High: If sales higher than 50
- Medium: If sales is between 21 and 50
- low: If the above conditions are not met

In [16]:
select_case_query = """SELECT OrderID, Sales, 
CASE 
WHEN Sales > 50 THEN 'High'
WHEN Sales BETWEEN 21 AND 50 THEN 'Medium'
ELSE 'Low'
END AS Category
FROM tbl_orders
"""

execute_display_query_results(select_case_query, cursor)

+---------+-------+----------+
| OrderID | Sales | Category |
+---------+-------+----------+
|    1    |  10   |   Low    |
|    2    |  15   |   Low    |
|    3    |  20   |   Low    |
|    4    |  60   |   High   |
|    5    |  25   |  Medium  |
|    6    |  50   |  Medium  |
|    7    |  30   |  Medium  |
|    8    |  90   |   High   |
|    9    |  20   |   Low    |
|   10    |  60   |   High   |
+---------+-------+----------+
10 rows returned in time: (0.003 sec)

In [17]:
select_case_query = """SELECT Category, SUM(Sales) AS TotalSales FROM
(SELECT OrderID, Sales,
CASE 
WHEN Sales > 50 THEN 'High'
WHEN Sales BETWEEN 21 AND 50 THEN 'Medium'
ELSE 'Low'
END AS Category
FROM tbl_orders) AS T
GROUP BY Category
ORDER BY TotalSales DESC;
"""

execute_display_query_results(select_case_query, cursor)

+----------+------------+
| Category | TotalSales |
+----------+------------+
|   High   |    210     |
|  Medium  |    105     |
|   Low    |     65     |
+----------+------------+
3 rows returned in time: (0.009 sec)

## Task 2
Retrieve employee details with gender displayed as full text

In [18]:
select_case_query = """SELECT * FROM
(SELECT *, 
CASE 
WHEN Gender = 'F' THEN 'Female'
WHEN Gender = 'M' THEN 'Male'
ELSE 'Other'
END AS GenderFullText
FROM tbl_employees) AS T;
"""

execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID | GenderFullText |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
|     1      |   Frank   |   Lee    | Marketing  | 1988-12-05 |   M    | 55000  |   NULL    |      Male      |
|     2      |   Kevin   |  Brown   | Marketing  | 1972-11-25 |   M    | 65000  |     1     |      Male      |
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |     Female     |
|     4      |  Michael  |   Ray    |   Sales    | 1977-02-10 |   M    | 90000  |     2     |      Male      |
|     5      |   Carol   |  Baker   |   Sales    | 1982-02-11 |   F    | 55000  |     3     |     Female     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
5 rows returned in time: (0.001 sec)

## Task 3
Retrieve customer details with abbreviated country code

In [19]:
execute_display_query_results(select_all_query("tbl_customers"), cursor)

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned in time: (0.004 sec)

In [22]:
select_case_query = """SELECT DISTINCT Country FROM tbl_customers;"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT * FROM
(SELECT *, 
CASE 
WHEN Country = 'Germany' THEN 'DE'
WHEN Country = 'USA' THEN 'US'
ELSE 'Other'
END AS CountryAbb
FROM tbl_customers) AS T;
"""

execute_display_query_results(select_case_query, cursor)

+---------+
| Country |
+---------+
| Germany |
|   USA   |
+---------+
2 rows returned in time: (0.001 sec)


+------------+-----------+----------+---------+-------+------------+
| CustomerID | FirstName | LastName | Country | Score | CountryAbb |
+------------+-----------+----------+---------+-------+------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     DE     |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     US     |
|     3      |   Mary    |   NULL   |   USA   |  750  |     US     |
|     4      |   Mark    | Schwarz  | Germany |  500  |     DE     |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     US     |
+------------+-----------+----------+---------+-------+------------+
5 rows returned in time: (0.001 sec)

In [23]:
## This form is only used when the operator is equal

select_case_query = """SELECT * FROM
(SELECT *, 
CASE Gender
WHEN 'F' THEN 'Female'
WHEN 'M' THEN 'Male'
ELSE 'Other'
END AS GenderFullText
FROM tbl_employees) AS T;
"""

execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID | GenderFullText |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
|     1      |   Frank   |   Lee    | Marketing  | 1988-12-05 |   M    | 55000  |   NULL    |      Male      |
|     2      |   Kevin   |  Brown   | Marketing  | 1972-11-25 |   M    | 65000  |     1     |      Male      |
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |     Female     |
|     4      |  Michael  |   Ray    |   Sales    | 1977-02-10 |   M    | 90000  |     2     |      Male      |
|     5      |   Carol   |  Baker   |   Sales    | 1982-02-11 |   F    | 55000  |     3     |     Female     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
5 rows returned in time: (0.001 sec)

## Task 4
Find the average scores of customers and treat Nulls as 0. Additional provide details such as CustomerID & LastName

In [26]:
select_case_query = """SELECT *, AVG(Score) OVER() AS AverageScore FROM
(SELECT *, 
CASE 
WHEN Country = 'Germany' THEN 'DE'
WHEN Country = 'USA' THEN 'US'
ELSE 'Other'
END AS CountryAbb
FROM tbl_customers) AS T;
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT *,
CASE 
WHEN Score IS NULL THEN 0
ELSE Score
End ScoreClean,
AVG(SCORE) OVER() AS AverageScore
FROM tbl_customers;
"""
execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+------------+--------------+
| CustomerID | FirstName | LastName | Country | Score | CountryAbb | AverageScore |
+------------+-----------+----------+---------+-------+------------+--------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     DE     |   625.0000   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     US     |   625.0000   |
|     3      |   Mary    |   NULL   |   USA   |  750  |     US     |   625.0000   |
|     4      |   Mark    | Schwarz  | Germany |  500  |     DE     |   625.0000   |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     US     |   625.0000   |
+------------+-----------+----------+---------+-------+------------+--------------+
5 rows returned in time: (0.002 sec)


+------------+-----------+----------+---------+-------+------------+--------------+
| CustomerID | FirstName | LastName | Country | Score | ScoreClean | AverageScore |
+------------+-----------+----------+---------+-------+------------+--------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |    350     |   625.0000   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |    900     |   625.0000   |
|     3      |   Mary    |   NULL   |   USA   |  750  |    750     |   625.0000   |
|     4      |   Mark    | Schwarz  | Germany |  500  |    500     |   625.0000   |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     0      |   625.0000   |
+------------+-----------+----------+---------+-------+------------+--------------+
5 rows returned in time: (0.001 sec)

In [27]:
select_case_query = """SELECT *,
AVG(
    CASE 
        WHEN Score IS NULL THEN 0
        ELSE Score
    End) OVER() AverageScoreClean,
AVG(SCORE) OVER() AS AverageScore
FROM tbl_customers;
"""

execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+-------------------+--------------+
| CustomerID | FirstName | LastName | Country | Score | AverageScoreClean | AverageScore |
+------------+-----------+----------+---------+-------+-------------------+--------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     500.0000      |   625.0000   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     500.0000      |   625.0000   |
|     3      |   Mary    |   NULL   |   USA   |  750  |     500.0000      |   625.0000   |
|     4      |   Mark    | Schwarz  | Germany |  500  |     500.0000      |   625.0000   |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     500.0000      |   625.0000   |
+------------+-----------+----------+---------+-------+-------------------+--------------+
5 rows returned in time: (0.003 sec)

In [29]:
select_case_query = """SELECT * , AVG(ScoreClean) OVER() AS AverageScoreClean FROM 
(SELECT *,
CASE 
WHEN Score IS NULL THEN 0
ELSE Score
End ScoreClean
FROM tbl_customers) AS T;
"""
execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+------------+-------------------+
| CustomerID | FirstName | LastName | Country | Score | ScoreClean | AverageScoreClean |
+------------+-----------+----------+---------+-------+------------+-------------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |    350     |     500.0000      |
|     2      |   Kevin   |  Brown   |   USA   |  900  |    900     |     500.0000      |
|     3      |   Mary    |   NULL   |   USA   |  750  |    750     |     500.0000      |
|     4      |   Mark    | Schwarz  | Germany |  500  |    500     |     500.0000      |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     0      |     500.0000      |
+------------+-----------+----------+---------+-------+------------+-------------------+
5 rows returned in time: (0.001 sec)

## Task 5
Count how many times each customer has made an order with sale greater than 30

In [30]:
select_query = """SELECT CustomerID, 
SUM(CASE 
WHEN Sales > 30 THEN 1
ELSE 0
END) AS TotalOrders
FROM tbl_orders GROUP BY CustomerID"""
execute_display_query_results(select_query, cursor)

+------------+-------------+
| CustomerID | TotalOrders |
+------------+-------------+
|     2      |      0      |
|     3      |      2      |
|     1      |      1      |
|     4      |      1      |
+------------+-------------+
4 rows returned in time: (0.001 sec)

In [31]:
select_query = """SELECT CustomerID, 
SUM(CASE 
WHEN Sales > 30 THEN 1
ELSE 0
END) AS TotalOrdersHigh,
COUNT(*) As TotalOrders
FROM tbl_orders GROUP BY CustomerID"""
execute_display_query_results(select_query, cursor)

+------------+-----------------+-------------+
| CustomerID | TotalOrdersHigh | TotalOrders |
+------------+-----------------+-------------+
|     2      |        0        |      3      |
|     3      |        2        |      3      |
|     1      |        1        |      3      |
|     4      |        1        |      1      |
+------------+-----------------+-------------+
4 rows returned in time: (0.001 sec)

# Nulls
<div style="text-align:center">
<img src="./null_functions.png" alt="drawing" width="1000"/>
</div>

```sql
IFNULL(value, replacement_value)      ---- fast
IFNULL(ShippingAddress, 'N/A')
IFNULL(ShippingAddress, BillingAddress)
```


```sql
COALESCE(value1, value2, value3, ....)
COALESCE(ShippingAddress, "unknown")          ---- slow
COALESCE(ShippingAddress, BillingAddress)
COALESCE(ShippingAddress, BillingAddress, "unknown")
```

In [35]:
select_case_query = """SELECT customerid, score, 
AVG(SCORE) OVER() AS AverageScore,
AVG(COALESCE(SCORE, 0)) OVER() AS AverageScore2,
AVG(IFNULL(SCORE, 0)) OVER() AS AverageScore3
FROM tbl_customers;
"""
execute_display_query_results(select_case_query, cursor)

+------------+-------+--------------+---------------+---------------+
| customerid | score | AverageScore | AverageScore2 | AverageScore3 |
+------------+-------+--------------+---------------+---------------+
|     1      |  350  |   625.0000   |   500.0000    |   500.0000    |
|     2      |  900  |   625.0000   |   500.0000    |   500.0000    |
|     3      |  750  |   625.0000   |   500.0000    |   500.0000    |
|     4      |  500  |   625.0000   |   500.0000    |   500.0000    |
|     5      | NULL  |   625.0000   |   500.0000    |   500.0000    |
+------------+-------+--------------+---------------+---------------+
5 rows returned in time: (0.001 sec)

# Task 1
Display the full name of customers in a single field by merging their first and last names, and add 10 bonus points to each customer's score

In [40]:
select_case_query = """SELECT *
FROM tbl_customers;
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT *,
CONCAT(firstname, ' ', lastname) AS fullname,
(score + 10) AS BonusScore
FROM tbl_customers;
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT *,
CONCAT(COALESCE(firstname, ''), ' ', COALESCE(lastname, '')) AS fullname,
(COALESCE(score, 0) + 10) AS BonusScore
FROM tbl_customers;
"""
execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned in time: (0.001 sec)


+------------+-----------+----------+---------+-------+-----------------+------------+
| CustomerID | FirstName | LastName | Country | Score |    fullname     | BonusScore |
+------------+-----------+----------+---------+-------+-----------------+------------+
|     1      |  Jossef   | Goldberg | Germany |  350  | Jossef Goldberg |    360     |
|     2      |   Kevin   |  Brown   |   USA   |  900  |   Kevin Brown   |    910     |
|     3      |   Mary    |   NULL   |   USA   |  750  |      NULL       |    760     |
|     4      |   Mark    | Schwarz  | Germany |  500  |  Mark Schwarz   |    510     |
|     5      |   Anna    |  Adams   |   USA   | NULL  |   Anna Adams    |    NULL    |
+------------+-----------+----------+---------+-------+-----------------+------------+
5 rows returned in time: (0.001 sec)


+------------+-----------+----------+---------+-------+-----------------+------------+
| CustomerID | FirstName | LastName | Country | Score |    fullname     | BonusScore |
+------------+-----------+----------+---------+-------+-----------------+------------+
|     1      |  Jossef   | Goldberg | Germany |  350  | Jossef Goldberg |    360     |
|     2      |   Kevin   |  Brown   |   USA   |  900  |   Kevin Brown   |    910     |
|     3      |   Mary    |   NULL   |   USA   |  750  |      Mary       |    760     |
|     4      |   Mark    | Schwarz  | Germany |  500  |  Mark Schwarz   |    510     |
|     5      |   Anna    |  Adams   |   USA   | NULL  |   Anna Adams    |     10     |
+------------+-----------+----------+---------+-------+-----------------+------------+
5 rows returned in time: (0.0 sec)

# Task 2
Sort the customers from lowest to highest with NULLs appearing last

In [55]:
select_case_query = """SELECT *
FROM tbl_customers
ORDER BY score;
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT *,
COALESCE(Score, 9999999)
FROM tbl_customers
ORDER BY COALESCE(Score, 9999999);
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT customerid, firstname, lastname, country, score FROM 
(SELECT *, 
MAX(Score) OVER() AS MaxScore
FROM tbl_customers) AS T
ORDER BY COALESCE(Score, MaxScore + 20);
"""
execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     5      |   Anna    |  Adams   |   USA   | NULL  |
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
+------------+-----------+----------+---------+-------+
5 rows returned in time: (0.001 sec)


+------------+-----------+----------+---------+-------+--------------------------+
| CustomerID | FirstName | LastName | Country | Score | COALESCE(Score, 9999999) |
+------------+-----------+----------+---------+-------+--------------------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |           350            |
|     4      |   Mark    | Schwarz  | Germany |  500  |           500            |
|     3      |   Mary    |   NULL   |   USA   |  750  |           750            |
|     2      |   Kevin   |  Brown   |   USA   |  900  |           900            |
|     5      |   Anna    |  Adams   |   USA   | NULL  |         9999999          |
+------------+-----------+----------+---------+-------+--------------------------+
5 rows returned in time: (0.0 sec)


+------------+-----------+----------+---------+-------+
| customerid | firstname | lastname | country | score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned in time: (0.001 sec)

# NULLIF(value1, value2)
Compares two expressions returns:
- NULL, if they are equal
- First Values, if they are not equal

In [58]:
# Find the sales price for each order by dividing sales by quantity
select_case_query = """SELECT orderid, sales, quantity, ROUND(sales / quantity, 2) AS Price FROM 
tbl_orders;
"""
execute_display_query_results(select_case_query, cursor)

+---------+-------+----------+-------+
| orderid | sales | quantity | Price |
+---------+-------+----------+-------+
|    1    |  10   |    1     | 10.00 |
|    2    |  15   |    1     | 15.00 |
|    3    |  20   |    2     | 10.00 |
|    4    |  60   |    2     | 30.00 |
|    5    |  25   |    1     | 25.00 |
|    6    |  50   |    2     | 25.00 |
|    7    |  30   |    2     | 15.00 |
|    8    |  90   |    3     | 30.00 |
|    9    |  20   |    2     | 10.00 |
|   10    |  60   |    0     | NULL  |
+---------+-------+----------+-------+
10 rows returned in time: (0.004 sec)

In [60]:
# Find the customers who have no scores
select_case_query = """SELECT * FROM 
tbl_customers
WHERE score IS NULL;
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT * FROM 
tbl_customers
WHERE score IS NOT NULL;
"""
execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
1 row returned in time: (0.001 sec)


+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
+------------+-----------+----------+---------+-------+
4 rows returned in time: (0.0 sec)

In [66]:
# Lsit all details for customers who have not placed any orders
select_case_query = """SELECT * FROM 
tbl_orders;
"""
execute_display_query_results(select_case_query, cursor)

print("\n")

select_case_query = """SELECT c.*, o.orderid FROM 
tbl_customers c LEFT JOIN tbl_orders o
ON c.customerid = o.customerid
WHERE o.orderid IS NULL;
"""
execute_display_query_results(select_case_query, cursor)

+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |    8157 W. Book    | 8157 W. Book  |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane  |               |    2     |  60   | 2025-01-20 05:50:33 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  |  136 Balboa Court  |               |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |   2947 Vine Lane   | 4311 Clay Rd  |    3     |  90   | 2025-02-18 10:45:22 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
10 rows returned in time: (0.001 sec)


+------------+-----------+----------+---------+-------+---------+
| CustomerID | FirstName | LastName | Country | Score | orderid |
+------------+-----------+----------+---------+-------+---------+
|     5      |   Anna    |  Adams   |   USA   | NULL  |  NULL   |
+------------+-----------+----------+---------+-------+---------+
1 row returned in time: (0.002 sec)

In [68]:
select_case_query = """SELECT c.*, o.orderid, o.sales, o.quantity, o.orderstatus FROM 
tbl_customers c INNER JOIN tbl_orders o
ON c.customerid = o.customerid;
"""
execute_display_query_results(select_case_query, cursor)

+------------+-----------+----------+---------+-------+---------+-------+----------+-------------+
| CustomerID | FirstName | LastName | Country | Score | orderid | sales | quantity | orderstatus |
+------------+-----------+----------+---------+-------+---------+-------+----------+-------------+
|     2      |   Kevin   |  Brown   |   USA   |  900  |    1    |  10   |    1     |  Delivered  |
|     3      |   Mary    |   NULL   |   USA   |  750  |    2    |  15   |    1     |   Shipped   |
|     1      |  Jossef   | Goldberg | Germany |  350  |    3    |  20   |    2     |  Delivered  |
|     1      |  Jossef   | Goldberg | Germany |  350  |    4    |  60   |    2     |   Shipped   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |    5    |  25   |    1     |  Delivered  |
|     3      |   Mary    |   NULL   |   USA   |  750  |    6    |  50   |    2     |  Delivered  |
|     1      |  Jossef   | Goldberg | Germany |  350  |    7    |  30   |    2     |  Delivered  |
|     4      |   Mark    | Schwarz  | Germany |  500  |    8    |  90   |    3     |   Shipped   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |    9    |  20   |    2     |   Shipped   |
|     3      |   Mary    |   NULL   |   USA   |  750  |   10    |  60   |    0     |   Shipped   |
+------------+-----------+----------+---------+-------+---------+-------+----------+-------------+
10 rows returned in time: (0.002 sec)